//MAKTRS   JOB (ACCT),
//            NOTIFY=&SYSUID,
//            TIME=10,MSGCLASS=H,CLASS=A,REGION=256M
//*--------------------------------------------------
//* Build one TRS file containing one PDS.
//* Each PDS member contains one XMIT file.
//*--------------------------------------------------
//CLEAN0   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE JOCHEMJ.VHR0M0.PTF.PDS PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.PDS.TRS PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.AEQAZFS PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAAUTH PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQABMOD PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAEXEC PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQALPA PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMENP PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMENU PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMJPN PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMOD PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPENP PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPENU PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPJPN PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQASAMP PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQASENP PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQASENU PURGE
  DELETE JOCHEMJ.VHR0M0.PTF.XMIT.SEQASJPN PURGE
  IF MAXCC > 0 THEN SET MAXCC = 0
/*
//ALLOC    EXEC PGM=IEFBR14
//PDS      DD DSN=JOCHEMJ.VHR0M0.PTF.PDS,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=3390,
//            SPACE=(CYL,(300,50,20)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=0)
//SEND     EXEC PGM=IKJEFT01,DYNAMNBR=100
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.AEQAZFS') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.AEQAZFS') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAAUTH') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAAUTH') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQABMOD') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQABMOD') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAEXEC') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAEXEC') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQALPA') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQALPA') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAMENP') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMENP') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAMENU') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMENU') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAMJPN') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMJPN') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAMOD') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMOD') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAPENP') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPENP') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAPENU') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPENU') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQAPJPN') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPJPN') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQASAMP') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQASAMP') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQASENP') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQASENP') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQASENU') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQASENU') +
    NOLOG NONOTIFY
  TRANSMIT VM30094.JOCHEMJ +
    DA('ZDBB.PGUTEST.DTDEBUG.VHR0DTE.SEQASJPN') +
    OUTDA('JOCHEMJ.VHR0M0.PTF.XMIT.SEQASJPN') +
    NOLOG NONOTIFY
/*
//*--------------------------------------------------
//* Copy XMIT files into PDS members
//*--------------------------------------------------
//CPY01    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.AEQAZFS
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(AEQAZFS)
//SYSIN    DD DUMMY
//CPY02    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAAUTH
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAAUTH)
//SYSIN    DD DUMMY
//CPY03    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQABMOD
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQABMOD)
//SYSIN    DD DUMMY
//CPY04    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAEXEC
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAEXEC)
//SYSIN    DD DUMMY
//CPY05    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQALPA
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQALPA)
//SYSIN    DD DUMMY
//CPY06    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMENP
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAMENP)
//SYSIN    DD DUMMY
//CPY07    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMENU
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAMENU)
//SYSIN    DD DUMMY
//CPY08    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMJPN
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAMJPN)
//SYSIN    DD DUMMY
//CPY09    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAMOD
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAMOD)
//SYSIN    DD DUMMY
//CPY10    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPENP
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAPENP)
//SYSIN    DD DUMMY
//CPY11    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPENU
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAPENU)
//SYSIN    DD DUMMY
//CPY12    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQAPJPN
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQAPJPN)
//SYSIN    DD DUMMY
//CPY13    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQASAMP
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQASAMP)
//SYSIN    DD DUMMY
//CPY14    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQASENP
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQASENP)
//SYSIN    DD DUMMY
//CPY15    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQASENU
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQASENU)
//SYSIN    DD DUMMY
//CPY16    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.XMIT.SEQASJPN
//SYSUT2   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS(SEQASJPN)
//SYSIN    DD DUMMY
//*--------------------------------------------------
//* Create final compressed TRS archive
//*--------------------------------------------------
//TERSE    EXEC PGM=AMATERSE,PARM=PACK
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=JOCHEMJ.VHR0M0.PTF.PDS
//SYSUT2   DD DISP=(NEW,CATLG,DELETE),
//            DSN=JOCHEMJ.VHR0M0.PTF.PDS.TRS,
//            UNIT=3390,
//            SPACE=(CYL,(300,50)),
//            DCB=(RECFM=FB,LRECL=1024,BLKSIZE=0)
//SYSUT3   DD DISP=(NEW,DELETE),
//            UNIT=3390,
//            SPACE=(CYL,(100,50))
/*
//*--------------------------------------------------
//* Copy final TRS archive from MVS dataset to USS
//*--------------------------------------------------
//COPYUSS  EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//INFILE   DD DSN=JOCHEMJ.VHR0M0.PTF.PDS.TRS,DISP=SHR
//OUTFILE  DD PATH='/u/jochemj/vhr0m0.manz.pds.trs',
//            PATHOPTS=(OWRONLY,OCREAT,OTRUNC),
//            PATHMODE=(SIRUSR,SIWUSR,SIRGRP,SIROTH),
//            FILEDATA=BINARY
//SYSTSIN  DD *
  OCOPY INDD(INFILE) OUTDD(OUTFILE) BINARY
/*