//RESTTAZ JOB CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*--------------------------------------------------
//* STEP0 : Cleanup old datasets if they exist
//*--------------------------------------------------
//CLEANUP EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE EQAW.VHR0M0.PTF.AEQAZFS PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAAUTH PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQABMOD PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAEXEC PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQALPA PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAMENP PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAMENU PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAMJPN PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAMOD PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAPENP PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAPENU PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQAPJPN PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQASAMP PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQASENP PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQASENU PURGE
 SET MAXCC=0
 DELETE EQAW.VHR0M0.PTF.SEQASJPN PURGE
 SET MAXCC=0
 DELETE IBMUSER.VHR0M0.PTF.PDS.TRS PURGE
 SET MAXCC=0
 DELETE IBMUSER.VHR0M0.PTF.PDS PURGE
 SET MAXCC=0
/*
//*--------------------------------------------------
//* STEP1 : Copy USS TRS file to MVS dataset
//*--------------------------------------------------
//COPYTRS EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//INFILE   DD PATH='/tmp/taz_tools/vhr0m0.manz.pds.trs',
//            PATHOPTS=(ORDONLY),
//            FILEDATA=BINARY
//OUTFILE  DD DSN=IBMUSER.VHR0M0.PTF.PDS.TRS,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=3390,
//            SPACE=(CYL,(300,50)),
//            DCB=(RECFM=FB,LRECL=1024,BLKSIZE=0)
//SYSTSIN  DD *
 OCOPY INDD(INFILE) OUTDD(OUTFILE) BINARY
/*
//*--------------------------------------------------
//* STEP2 : UNPACK TRS archive
//*--------------------------------------------------
//UNTERSE EXEC PGM=AMATERSE,PARM=UNPACK
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=IBMUSER.VHR0M0.PTF.PDS.TRS
//SYSUT2   DD DISP=(NEW,CATLG,DELETE),
//            DSN=IBMUSER.VHR0M0.PTF.PDS,
//            UNIT=3390,
//            SPACE=(CYL,(300,100,50)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=0)
//SYSUT3   DD DISP=(NEW,DELETE),
//            UNIT=3390,
//            SPACE=(CYL,(100,50))
//*--------------------------------------------------
//* STEP3 : RECEIVE XMIT members into real datasets
//*--------------------------------------------------
//RXMIT01 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(AEQAZFS)')
 DSN('EQAW.VHR0M0.PTF.AEQAZFS')
/*
//RXMIT02 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAAUTH)')
 DSN('EQAW.VHR0M0.PTF.SEQAAUTH')
/*
//RXMIT03 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQABMOD)')
 DSN('EQAW.VHR0M0.PTF.SEQABMOD')
/*
//RXMIT04 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAEXEC)')
 DSN('EQAW.VHR0M0.PTF.SEQAEXEC')
/*
//RXMIT05 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQALPA)')
 DSN('EQAW.VHR0M0.PTF.SEQALPA')
/*
//RXMIT06 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAMENP)')
 DSN('EQAW.VHR0M0.PTF.SEQAMENP')
/*
//RXMIT07 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAMENU)')
 DSN('EQAW.VHR0M0.PTF.SEQAMENU')
/*
//RXMIT08 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAMJPN)')
 DSN('EQAW.VHR0M0.PTF.SEQAMJPN')
/*
//RXMIT09 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAMOD)')
 DSN('EQAW.VHR0M0.PTF.SEQAMOD')
/*
//RXMIT10 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAPENP)')
 DSN('EQAW.VHR0M0.PTF.SEQAPENP')
/*
//RXMIT11 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAPENU)')
 DSN('EQAW.VHR0M0.PTF.SEQAPENU')
/*
//RXMIT12 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQAPJPN)')
 DSN('EQAW.VHR0M0.PTF.SEQAPJPN')
/*
//RXMIT13 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQASAMP)')
 DSN('EQAW.VHR0M0.PTF.SEQASAMP')
/*
//RXMIT14 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQASENP)')
 DSN('EQAW.VHR0M0.PTF.SEQASENP')
/*
//RXMIT15 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQASENU)')
 DSN('EQAW.VHR0M0.PTF.SEQASENU')
/*
//RXMIT16 EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RECEIVE INDSN('IBMUSER.VHR0M0.PTF.PDS(SEQASJPN)')
 DSN('EQAW.VHR0M0.PTF.SEQASJPN')
/*